[Skip to main content](https://docs.falkordb.com/udfs/flex/text/levenshtein.html#main-content) Link Menu Expand (external link) Document Search Copy Copied
[ ](https://www.falkordb.com)
  * [Home](https://docs.falkordb.com/)
  * [Getting Started](https://docs.falkordb.com/getting-started/)
    * [Configuration](https://docs.falkordb.com/getting-started/configuration.html)
    * [Client Libraries](https://docs.falkordb.com/getting-started/clients.html)
  * [Commands](https://docs.falkordb.com/commands/)
    * [GRAPH.QUERY](https://docs.falkordb.com/commands/graph.query.html)
    * [GRAPH.RO_QUERY](https://docs.falkordb.com/commands/graph.ro-query.html)
    * [GRAPH.DELETE](https://docs.falkordb.com/commands/graph.delete.html)
    * [GRAPH.EXPLAIN](https://docs.falkordb.com/commands/graph.explain.html)
    * [GRAPH.LIST](https://docs.falkordb.com/commands/graph.list.html)
    * [GRAPH.PROFILE](https://docs.falkordb.com/commands/graph.profile.html)
    * [GRAPH.CONFIG-SET](https://docs.falkordb.com/commands/graph.config-set.html)
    * [GRAPH.CONSTRAINT DROP](https://docs.falkordb.com/commands/graph.constraint-drop.html)
    * [GRAPH.COPY](https://docs.falkordb.com/commands/graph.copy.html)
    * [GRAPH.INFO](https://docs.falkordb.com/commands/graph.info.html)
    * [GRAPH.MEMORY](https://docs.falkordb.com/commands/graph.memory.html)
    * [ACL](https://docs.falkordb.com/commands/acl.html)
    * [GRAPH.CONFIG-GET](https://docs.falkordb.com/commands/graph.config-get.html)
    * [GRAPH.CONSTRAINT CREATE](https://docs.falkordb.com/commands/graph.constraint-create.html)
    * [GRAPH.SLOWLOG](https://docs.falkordb.com/commands/graph.slowlog.html)
  * [Algorithms](https://docs.falkordb.com/algorithms/)
    * [BFS](https://docs.falkordb.com/algorithms/bfs.html)
    * [Betweenness Centrality](https://docs.falkordb.com/algorithms/betweenness-centrality.html)
    * [Community Detection using Label Propagation (CDLP)](https://docs.falkordb.com/algorithms/cdlp.html)
    * [PageRank](https://docs.falkordb.com/algorithms/pagerank.html)
    * [algo.SPpaths](https://docs.falkordb.com/algorithms/sppath.html)
    * [algo.SSpaths](https://docs.falkordb.com/algorithms/sspath.html)
    * [Weakly Connected Components (WCC)](https://docs.falkordb.com/algorithms/wcc.html)
    * [MSF](https://docs.falkordb.com/algorithms/msf.html)
  * [Data types](https://docs.falkordb.com/datatypes.html)
  * [Integration](https://docs.falkordb.com/integration/)
    * [Rest API](https://docs.falkordb.com/integration/rest.html)
    * [Kafka Connect Sink](https://docs.falkordb.com/integration/kafka-connect.html)
    * [Apache Jena](https://docs.falkordb.com/integration/jena.html)
    * [BOLT protocol support](https://docs.falkordb.com/integration/bolt-support.html)
    * [Spring Data FalkorDB](https://docs.falkordb.com/integration/spring-data-falkordb.html)
    * [Snowflake Integration](https://docs.falkordb.com/integration/snowflake.html)
  * [UDFs](https://docs.falkordb.com/udfs/)
    * [FLEX Function Reference](https://docs.falkordb.com/udfs/flex/)
      * [Bitwise Functions](https://docs.falkordb.com/udfs/flex/bitwise/)
        * [bitwise.and](https://docs.falkordb.com/udfs/flex/bitwise/and.html)
        * [bitwise.not](https://docs.falkordb.com/udfs/flex/bitwise/not.html)
        * [bitwise.or](https://docs.falkordb.com/udfs/flex/bitwise/or.html)
        * [bitwise.shiftLeft](https://docs.falkordb.com/udfs/flex/bitwise/shiftLeft.html)
        * [bitwise.shiftRight](https://docs.falkordb.com/udfs/flex/bitwise/shiftRight.html)
        * [bitwise.xor](https://docs.falkordb.com/udfs/flex/bitwise/xor.html)
      * [Collection Functions](https://docs.falkordb.com/udfs/flex/collections/)
        * [coll.frequencies](https://docs.falkordb.com/udfs/flex/collections/frequencies.html)
        * [coll.intersection](https://docs.falkordb.com/udfs/flex/collections/intersection.html)
        * [coll.shuffle](https://docs.falkordb.com/udfs/flex/collections/shuffle.html)
        * [coll.union](https://docs.falkordb.com/udfs/flex/collections/union.html)
        * [coll.zip](https://docs.falkordb.com/udfs/flex/collections/zip.html)
      * [Date Functions](https://docs.falkordb.com/udfs/flex/date/)
        * [date.format](https://docs.falkordb.com/udfs/flex/date/format.html)
        * [date.parse](https://docs.falkordb.com/udfs/flex/date/parse.html)
        * [date.toTimeZone](https://docs.falkordb.com/udfs/flex/date/toTimeZone.html)
        * [date.truncate](https://docs.falkordb.com/udfs/flex/date/truncate.html)
      * [JSON Functions](https://docs.falkordb.com/udfs/flex/json/)
        * [json.fromJsonList](https://docs.falkordb.com/udfs/flex/json/fromJsonList.html)
        * [json.fromJsonMap](https://docs.falkordb.com/udfs/flex/json/fromJsonMap.html)
        * [json.toJson](https://docs.falkordb.com/udfs/flex/json/toJson.html)
      * [Map Functions](https://docs.falkordb.com/udfs/flex/map/)
        * [map.fromPairs](https://docs.falkordb.com/udfs/flex/map/fromPairs.html)
        * [map.merge](https://docs.falkordb.com/udfs/flex/map/merge.html)
        * [map.removeKey](https://docs.falkordb.com/udfs/flex/map/removeKey.html)
        * [map.removeKeys](https://docs.falkordb.com/udfs/flex/map/removeKeys.html)
        * [map.submap](https://docs.falkordb.com/udfs/flex/map/submap.html)
      * [Similarity Functions](https://docs.falkordb.com/udfs/flex/similarity/)
        * [sim.jaccard](https://docs.falkordb.com/udfs/flex/similarity/jaccard.html)
      * [Text Functions](https://docs.falkordb.com/udfs/flex/text/)
        * [text.camelCase](https://docs.falkordb.com/udfs/flex/text/camelCase.html)
        * [text.capitalize](https://docs.falkordb.com/udfs/flex/text/capitalize.html)
        * [text.decapitalize](https://docs.falkordb.com/udfs/flex/text/decapitalize.html)
        * [text.format](https://docs.falkordb.com/udfs/flex/text/format.html)
        * [text.indexOf](https://docs.falkordb.com/udfs/flex/text/indexOf.html)
        * [text.indexesOf](https://docs.falkordb.com/udfs/flex/text/indexesOf.html)
        * [text.jaroWinkler](https://docs.falkordb.com/udfs/flex/text/jaroWinkler.html)
        * [text.join](https://docs.falkordb.com/udfs/flex/text/join.html)
        * text.levenshtein
        * [text.lpad](https://docs.falkordb.com/udfs/flex/text/lpad.html)
        * [text.regexGroups](https://docs.falkordb.com/udfs/flex/text/regexGroups.html)
        * [text.repeat](https://docs.falkordb.com/udfs/flex/text/repeat.html)
        * [text.replace](https://docs.falkordb.com/udfs/flex/text/replace.html)
        * [text.rpad](https://docs.falkordb.com/udfs/flex/text/rpad.html)
        * [text.snakeCase](https://docs.falkordb.com/udfs/flex/text/snakeCase.html)
        * [text.swapCase](https://docs.falkordb.com/udfs/flex/text/swapCase.html)
        * [text.upperCamelCase](https://docs.falkordb.com/udfs/flex/text/upperCamelCase.html)
  * [Cypher Language](https://docs.falkordb.com/cypher/)
    * [MATCH](https://docs.falkordb.com/cypher/match.html)
    * [OPTIONAL MATCH](https://docs.falkordb.com/cypher/optional-match.html)
    * [WHERE](https://docs.falkordb.com/cypher/where.html)
    * [RETURN](https://docs.falkordb.com/cypher/return.html)
    * [ORDER BY](https://docs.falkordb.com/cypher/order-by.html)
    * [SKIP](https://docs.falkordb.com/cypher/skip.html)
    * [LIMIT](https://docs.falkordb.com/cypher/limit.html)
    * [CREATE](https://docs.falkordb.com/cypher/create.html)
    * [DELETE](https://docs.falkordb.com/cypher/delete.html)
    * [SET](https://docs.falkordb.com/cypher/set.html)
    * [MERGE](https://docs.falkordb.com/cypher/merge.html)
    * [WITH](https://docs.falkordb.com/cypher/with.html)
    * [UNION](https://docs.falkordb.com/cypher/union.html)
    * [UNWIND](https://docs.falkordb.com/cypher/unwind.html)
    * [FOREACH](https://docs.falkordb.com/cypher/foreach.html)
    * [CALL](https://docs.falkordb.com/cypher/call.html)
    * [LOAD CSV](https://docs.falkordb.com/cypher/load-csv.html)
    * [Functions](https://docs.falkordb.com/cypher/functions.html)
    * [Procedures](https://docs.falkordb.com/cypher/procedures.html)
    * [Indexing](https://docs.falkordb.com/cypher/indexing/)
      * [Range Index](https://docs.falkordb.com/cypher/indexing/range-index.html)
      * [Full-text Index](https://docs.falkordb.com/cypher/indexing/fulltext-index.html)
      * [Vector Index](https://docs.falkordb.com/cypher/indexing/vector-index.html)
    * [Cypher coverage](https://docs.falkordb.com/cypher/cypher-support.html)
    * [REMOVE](https://docs.falkordb.com/cypher/remove.html)
    * [Known limitations](https://docs.falkordb.com/cypher/known-limitations.html)
  * [GenAI Tools](https://docs.falkordb.com/genai-tools/)
    * [GraphRAG-SDK](https://docs.falkordb.com/genai-tools/graphrag-sdk.html)
    * [AG2](https://docs.falkordb.com/genai-tools/ag2.html)
    * [LangChain](https://docs.falkordb.com/genai-tools/langchain.html)
    * [LangGraph](https://docs.falkordb.com/genai-tools/langgraph.html)
    * [LlamaIndex](https://docs.falkordb.com/genai-tools/llamaindex.html)
    * [GraphRAG Toolkit](https://docs.falkordb.com/genai-tools/graphrag-toolkit.html)
    * [MCP Server](https://docs.falkordb.com/genai-tools/mcpserver/)
      * [Quick Start](https://docs.falkordb.com/genai-tools/mcpserver/quickstart.html)
      * [Configuration](https://docs.falkordb.com/genai-tools/mcpserver/configuration.html)
      * [Docker Deployment](https://docs.falkordb.com/genai-tools/mcpserver/docker.html)
  * [Browser](https://docs.falkordb.com/browser/)
    * [UI Elements](https://docs.falkordb.com/browser/ui/)
      * [Login Screen](https://docs.falkordb.com/browser/ui/login.html)
      * [Navigation & Header](https://docs.falkordb.com/browser/ui/navigation.html)
      * [Settings Page](https://docs.falkordb.com/browser/ui/settings.html)
      * [Graph Page (Layout)](https://docs.falkordb.com/browser/ui/graph-page.html)
      * [Main Graph Canvas](https://docs.falkordb.com/browser/ui/graph-canvas.html)
      * [Graph Info Panel](https://docs.falkordb.com/browser/ui/graph-info-panel.html)
      * [Style Panel](https://docs.falkordb.com/browser/ui/style-panel.html)
      * [Data / Property Panel](https://docs.falkordb.com/browser/ui/data-panel.html)
      * [Query Editor](https://docs.falkordb.com/browser/ui/query-editor.html)
      * [Query History](https://docs.falkordb.com/browser/ui/query-history.html)
      * [Table View](https://docs.falkordb.com/browser/ui/table-view.html)
      * [Metadata View](https://docs.falkordb.com/browser/ui/metadata-view.html)
      * [Graph Toolbar & Element Actions](https://docs.falkordb.com/browser/ui/toolbar-actions.html)
      * [Chat Panel](https://docs.falkordb.com/browser/ui/chat-panel.html)
  * [Cloud DBaaS](https://docs.falkordb.com/cloud/)
    * [Free Tier](https://docs.falkordb.com/cloud/free-tier.html)
    * [Startup Tier](https://docs.falkordb.com/cloud/startup-tier.html)
    * [Pro Tier](https://docs.falkordb.com/cloud/pro-tier.html)
    * [Enterprise Tier](https://docs.falkordb.com/cloud/enterprise-tier.html)
    * [Features](https://docs.falkordb.com/cloud/features.html)
  * [Operations](https://docs.falkordb.com/operations/)
    * [Migration](https://docs.falkordb.com/operations/migration/)
      * [RedisGraph to FalkorDB](https://docs.falkordb.com/operations/migration/redisgraph-to-falkordb.html)
      * [Neo4j to FalkorDB](https://docs.falkordb.com/operations/migration/neo4j-to-falkordb.html)
      * [Kuzu to FalkorDB](https://docs.falkordb.com/operations/migration/kuzu-to-falkordb.html)
      * [RDF to FalkorDB](https://docs.falkordb.com/operations/migration/rdf-to-falkordb.html)
      * [SQL Sources to FalkorDB (Online Migration)](https://docs.falkordb.com/operations/migration/sql-to-falkordb.html)
    * [Durability](https://docs.falkordb.com/operations/durability.html)
      * [Persistence on Docker](https://docs.falkordb.com/operations/persistence.html)
    * [Replication](https://docs.falkordb.com/operations/replication.html)
    * [Cluster](https://docs.falkordb.com/operations/cluster.html)
    * [Kubernetes support](https://docs.falkordb.com/operations/k8s-support.html)
    * [OpenTelemetry Integration](https://docs.falkordb.com/operations/opentelemetry.html)
    * [Railway](https://docs.falkordb.com/operations/railway.html)
    * [FalkorDBLite](https://docs.falkordb.com/operations/falkordblite/)
      * [FalkorDBLite (Python)](https://docs.falkordb.com/operations/falkordblite/falkordblite-py.html)
      * [FalkorDBLite (TypeScript)](https://docs.falkordb.com/operations/falkordblite/falkordblite-ts.html)
    * [Lightning.AI](https://docs.falkordb.com/operations/lightning-ai.html)
    * [Building Docker](https://docs.falkordb.com/operations/building-docker.html)
    * [KubeBlocks](https://docs.falkordb.com/operations/kubeblocks.html)
    * [Docker and Docker Compose](https://docs.falkordb.com/operations/docker.html)
  * [Agentic Memory](https://docs.falkordb.com/agentic-memory/)
    * [Graphiti](https://docs.falkordb.com/agentic-memory/graphiti.html)
    * [Cognee](https://docs.falkordb.com/agentic-memory/cognee.html)
    * [Graphiti MCP Server](https://docs.falkordb.com/agentic-memory/graphiti-mcp-server.html)
    * [Mem0](https://docs.falkordb.com/agentic-memory/mem0.html)
  * [The FalkorDB Design](https://docs.falkordb.com/design/)
    * [Client Specification](https://docs.falkordb.com/design/client-spec.html)
    * [Result Set Structure](https://docs.falkordb.com/design/result-structure.html)
    * [GRAPH.BULK endpoint specification](https://docs.falkordb.com/design/bulk-spec.html)
    * [Third Party](https://docs.falkordb.com/design/third-party.html)
  * [References](https://docs.falkordb.com/References/)
    * [FalkorDB License](https://docs.falkordb.com/References/license.html)

This site uses
Search FalkorDB Docs
  1. [UDFs](https://docs.falkordb.com/udfs/)
  2. [FLEX Function Reference](https://docs.falkordb.com/udfs/flex/)
  3. [Text Functions](https://docs.falkordb.com/udfs/flex/text/)
  4. text.levenshtein


#  [](https://docs.falkordb.com/udfs/flex/text/levenshtein.html#textlevenshtein) text.levenshtein
##  [](https://docs.falkordb.com/udfs/flex/text/levenshtein.html#description) Description
Computes the Levenshtein edit distance between two strings. The edit distance is the minimum number of single-character edits (insertions, deletions, or substitutions) required to change one string into another. This is useful for fuzzy string matching, spell checking, and finding similar records.
##  [](https://docs.falkordb.com/udfs/flex/text/levenshtein.html#syntax) Syntax
```
flex.text.levenshtein(string1, string2)

```

##  [](https://docs.falkordb.com/udfs/flex/text/levenshtein.html#parameters) Parameters
Parameter | Type | Required | Description
---|---|---|---
`string1` | string | Yes | The first string to compare
`string2` | string | Yes | The second string to compare
##  [](https://docs.falkordb.com/udfs/flex/text/levenshtein.html#returns) Returns
**Type:** number (integer)
The minimum number of single-character edits needed to transform `string1` into `string2`. Returns `0` if the strings are identical.
##  [](https://docs.falkordb.com/udfs/flex/text/levenshtein.html#examples) Examples
###  [](https://docs.falkordb.com/udfs/flex/text/levenshtein.html#example-1-basic-string-comparison) Example 1: Basic String Comparison
```
// Compare two similar strings
RETURN flex.text.levenshtein('kitten', 'sitting') AS distance

```

**Output:**
```
distance
--------
3

```

###  [](https://docs.falkordb.com/udfs/flex/text/levenshtein.html#example-2-finding-similar-user-names) Example 2: Finding Similar User Names
```
// Find users with names similar to "Sarah" within edit distance of 2
MATCH (u:User)
WHERE flex.text.levenshtein(u.name, 'Sarah') <= 2
RETURN u.name, u.email, flex.text.levenshtein(u.name, 'Sarah') AS distance
ORDER BY distance

```

###  [](https://docs.falkordb.com/udfs/flex/text/levenshtein.html#example-3-fuzzy-matching-with-multiple-candidates) Example 3: Fuzzy Matching with Multiple Candidates
```
// Find the closest matching product name
WITH 'iPhone' AS search_term
MATCH (p:Product)
WITH p, flex.text.levenshtein(p.name, search_term) AS distance
WHERE distance <= 3
RETURN p.name, distance
ORDER BY distance
LIMIT 5

```

##  [](https://docs.falkordb.com/udfs/flex/text/levenshtein.html#notes) Notes
  * Handles `null` values gracefully by treating them as empty strings
  * The function is symmetric: `levenshtein(a, b) = levenshtein(b, a)`
  * Empty strings return the length of the non-empty string as distance
  * Two `null` values return distance of `0`
  * Optimized for performance with memory-efficient implementation
  * Case-sensitive comparison (use `toLower()` if case-insensitive matching is needed)


##  [](https://docs.falkordb.com/udfs/flex/text/levenshtein.html#see-also) See Also
  * [sim.jaccard](https://docs.falkordb.com/udfs/flex/similarity/jaccard.html) - Set-based similarity for collections
  * [text.jaroWinkler](https://docs.falkordb.com/udfs/flex/text/jaroWinkler.html) - Alternative string similarity metric


* * *
This site uses
