[Skip to main content](https://docs.falkordb.com/udfs/#main-content) Link Menu Expand (external link) Document Search Copy Copied
[ ](https://www.falkordb.com)
  * [Home](https://docs.falkordb.com/)
  * [Getting Started](https://docs.falkordb.com/getting-started/)
    * [Configuration](https://docs.falkordb.com/getting-started/configuration.html)
    * [Client Libraries](https://docs.falkordb.com/getting-started/clients.html)
  * [Commands](https://docs.falkordb.com/commands/)
    * [GRAPH.QUERY](https://docs.falkordb.com/commands/graph.query.html)
    * [GRAPH.RO_QUERY](https://docs.falkordb.com/commands/graph.ro-query.html)
    * [GRAPH.DELETE](https://docs.falkordb.com/commands/graph.delete.html)
    * [GRAPH.EXPLAIN](https://docs.falkordb.com/commands/graph.explain.html)
    * [GRAPH.LIST](https://docs.falkordb.com/commands/graph.list.html)
    * [GRAPH.PROFILE](https://docs.falkordb.com/commands/graph.profile.html)
    * [GRAPH.CONFIG-SET](https://docs.falkordb.com/commands/graph.config-set.html)
    * [GRAPH.CONSTRAINT DROP](https://docs.falkordb.com/commands/graph.constraint-drop.html)
    * [GRAPH.COPY](https://docs.falkordb.com/commands/graph.copy.html)
    * [GRAPH.INFO](https://docs.falkordb.com/commands/graph.info.html)
    * [GRAPH.MEMORY](https://docs.falkordb.com/commands/graph.memory.html)
    * [ACL](https://docs.falkordb.com/commands/acl.html)
    * [GRAPH.CONFIG-GET](https://docs.falkordb.com/commands/graph.config-get.html)
    * [GRAPH.CONSTRAINT CREATE](https://docs.falkordb.com/commands/graph.constraint-create.html)
    * [GRAPH.SLOWLOG](https://docs.falkordb.com/commands/graph.slowlog.html)
  * [Algorithms](https://docs.falkordb.com/algorithms/)
    * [BFS](https://docs.falkordb.com/algorithms/bfs.html)
    * [Betweenness Centrality](https://docs.falkordb.com/algorithms/betweenness-centrality.html)
    * [Community Detection using Label Propagation (CDLP)](https://docs.falkordb.com/algorithms/cdlp.html)
    * [PageRank](https://docs.falkordb.com/algorithms/pagerank.html)
    * [algo.SPpaths](https://docs.falkordb.com/algorithms/sppath.html)
    * [algo.SSpaths](https://docs.falkordb.com/algorithms/sspath.html)
    * [Weakly Connected Components (WCC)](https://docs.falkordb.com/algorithms/wcc.html)
    * [MSF](https://docs.falkordb.com/algorithms/msf.html)
  * [Data types](https://docs.falkordb.com/datatypes.html)
  * [Integration](https://docs.falkordb.com/integration/)
    * [Rest API](https://docs.falkordb.com/integration/rest.html)
    * [Kafka Connect Sink](https://docs.falkordb.com/integration/kafka-connect.html)
    * [Apache Jena](https://docs.falkordb.com/integration/jena.html)
    * [BOLT protocol support](https://docs.falkordb.com/integration/bolt-support.html)
    * [Spring Data FalkorDB](https://docs.falkordb.com/integration/spring-data-falkordb.html)
    * [Snowflake Integration](https://docs.falkordb.com/integration/snowflake.html)
  * UDFs
    * [FLEX Function Reference](https://docs.falkordb.com/udfs/flex/)
      * [Bitwise Functions](https://docs.falkordb.com/udfs/flex/bitwise/)
        * [bitwise.and](https://docs.falkordb.com/udfs/flex/bitwise/and.html)
        * [bitwise.not](https://docs.falkordb.com/udfs/flex/bitwise/not.html)
        * [bitwise.or](https://docs.falkordb.com/udfs/flex/bitwise/or.html)
        * [bitwise.shiftLeft](https://docs.falkordb.com/udfs/flex/bitwise/shiftLeft.html)
        * [bitwise.shiftRight](https://docs.falkordb.com/udfs/flex/bitwise/shiftRight.html)
        * [bitwise.xor](https://docs.falkordb.com/udfs/flex/bitwise/xor.html)
      * [Collection Functions](https://docs.falkordb.com/udfs/flex/collections/)
        * [coll.frequencies](https://docs.falkordb.com/udfs/flex/collections/frequencies.html)
        * [coll.intersection](https://docs.falkordb.com/udfs/flex/collections/intersection.html)
        * [coll.shuffle](https://docs.falkordb.com/udfs/flex/collections/shuffle.html)
        * [coll.union](https://docs.falkordb.com/udfs/flex/collections/union.html)
        * [coll.zip](https://docs.falkordb.com/udfs/flex/collections/zip.html)
      * [Date Functions](https://docs.falkordb.com/udfs/flex/date/)
        * [date.format](https://docs.falkordb.com/udfs/flex/date/format.html)
        * [date.parse](https://docs.falkordb.com/udfs/flex/date/parse.html)
        * [date.toTimeZone](https://docs.falkordb.com/udfs/flex/date/toTimeZone.html)
        * [date.truncate](https://docs.falkordb.com/udfs/flex/date/truncate.html)
      * [JSON Functions](https://docs.falkordb.com/udfs/flex/json/)
        * [json.fromJsonList](https://docs.falkordb.com/udfs/flex/json/fromJsonList.html)
        * [json.fromJsonMap](https://docs.falkordb.com/udfs/flex/json/fromJsonMap.html)
        * [json.toJson](https://docs.falkordb.com/udfs/flex/json/toJson.html)
      * [Map Functions](https://docs.falkordb.com/udfs/flex/map/)
        * [map.fromPairs](https://docs.falkordb.com/udfs/flex/map/fromPairs.html)
        * [map.merge](https://docs.falkordb.com/udfs/flex/map/merge.html)
        * [map.removeKey](https://docs.falkordb.com/udfs/flex/map/removeKey.html)
        * [map.removeKeys](https://docs.falkordb.com/udfs/flex/map/removeKeys.html)
        * [map.submap](https://docs.falkordb.com/udfs/flex/map/submap.html)
      * [Similarity Functions](https://docs.falkordb.com/udfs/flex/similarity/)
        * [sim.jaccard](https://docs.falkordb.com/udfs/flex/similarity/jaccard.html)
      * [Text Functions](https://docs.falkordb.com/udfs/flex/text/)
        * [text.camelCase](https://docs.falkordb.com/udfs/flex/text/camelCase.html)
        * [text.capitalize](https://docs.falkordb.com/udfs/flex/text/capitalize.html)
        * [text.decapitalize](https://docs.falkordb.com/udfs/flex/text/decapitalize.html)
        * [text.format](https://docs.falkordb.com/udfs/flex/text/format.html)
        * [text.indexOf](https://docs.falkordb.com/udfs/flex/text/indexOf.html)
        * [text.indexesOf](https://docs.falkordb.com/udfs/flex/text/indexesOf.html)
        * [text.jaroWinkler](https://docs.falkordb.com/udfs/flex/text/jaroWinkler.html)
        * [text.join](https://docs.falkordb.com/udfs/flex/text/join.html)
        * [text.levenshtein](https://docs.falkordb.com/udfs/flex/text/levenshtein.html)
        * [text.lpad](https://docs.falkordb.com/udfs/flex/text/lpad.html)
        * [text.regexGroups](https://docs.falkordb.com/udfs/flex/text/regexGroups.html)
        * [text.repeat](https://docs.falkordb.com/udfs/flex/text/repeat.html)
        * [text.replace](https://docs.falkordb.com/udfs/flex/text/replace.html)
        * [text.rpad](https://docs.falkordb.com/udfs/flex/text/rpad.html)
        * [text.snakeCase](https://docs.falkordb.com/udfs/flex/text/snakeCase.html)
        * [text.swapCase](https://docs.falkordb.com/udfs/flex/text/swapCase.html)
        * [text.upperCamelCase](https://docs.falkordb.com/udfs/flex/text/upperCamelCase.html)
  * [Cypher Language](https://docs.falkordb.com/cypher/)
    * [MATCH](https://docs.falkordb.com/cypher/match.html)
    * [OPTIONAL MATCH](https://docs.falkordb.com/cypher/optional-match.html)
    * [WHERE](https://docs.falkordb.com/cypher/where.html)
    * [RETURN](https://docs.falkordb.com/cypher/return.html)
    * [ORDER BY](https://docs.falkordb.com/cypher/order-by.html)
    * [SKIP](https://docs.falkordb.com/cypher/skip.html)
    * [LIMIT](https://docs.falkordb.com/cypher/limit.html)
    * [CREATE](https://docs.falkordb.com/cypher/create.html)
    * [DELETE](https://docs.falkordb.com/cypher/delete.html)
    * [SET](https://docs.falkordb.com/cypher/set.html)
    * [MERGE](https://docs.falkordb.com/cypher/merge.html)
    * [WITH](https://docs.falkordb.com/cypher/with.html)
    * [UNION](https://docs.falkordb.com/cypher/union.html)
    * [UNWIND](https://docs.falkordb.com/cypher/unwind.html)
    * [FOREACH](https://docs.falkordb.com/cypher/foreach.html)
    * [CALL](https://docs.falkordb.com/cypher/call.html)
    * [LOAD CSV](https://docs.falkordb.com/cypher/load-csv.html)
    * [Functions](https://docs.falkordb.com/cypher/functions.html)
    * [Procedures](https://docs.falkordb.com/cypher/procedures.html)
    * [Indexing](https://docs.falkordb.com/cypher/indexing/)
      * [Range Index](https://docs.falkordb.com/cypher/indexing/range-index.html)
      * [Full-text Index](https://docs.falkordb.com/cypher/indexing/fulltext-index.html)
      * [Vector Index](https://docs.falkordb.com/cypher/indexing/vector-index.html)
    * [Cypher coverage](https://docs.falkordb.com/cypher/cypher-support.html)
    * [REMOVE](https://docs.falkordb.com/cypher/remove.html)
    * [Known limitations](https://docs.falkordb.com/cypher/known-limitations.html)
  * [GenAI Tools](https://docs.falkordb.com/genai-tools/)
    * [GraphRAG-SDK](https://docs.falkordb.com/genai-tools/graphrag-sdk.html)
    * [AG2](https://docs.falkordb.com/genai-tools/ag2.html)
    * [LangChain](https://docs.falkordb.com/genai-tools/langchain.html)
    * [LangGraph](https://docs.falkordb.com/genai-tools/langgraph.html)
    * [LlamaIndex](https://docs.falkordb.com/genai-tools/llamaindex.html)
    * [GraphRAG Toolkit](https://docs.falkordb.com/genai-tools/graphrag-toolkit.html)
    * [MCP Server](https://docs.falkordb.com/genai-tools/mcpserver/)
      * [Quick Start](https://docs.falkordb.com/genai-tools/mcpserver/quickstart.html)
      * [Configuration](https://docs.falkordb.com/genai-tools/mcpserver/configuration.html)
      * [Docker Deployment](https://docs.falkordb.com/genai-tools/mcpserver/docker.html)
  * [Browser](https://docs.falkordb.com/browser/)
    * [UI Elements](https://docs.falkordb.com/browser/ui/)
      * [Login Screen](https://docs.falkordb.com/browser/ui/login.html)
      * [Navigation & Header](https://docs.falkordb.com/browser/ui/navigation.html)
      * [Settings Page](https://docs.falkordb.com/browser/ui/settings.html)
      * [Graph Page (Layout)](https://docs.falkordb.com/browser/ui/graph-page.html)
      * [Main Graph Canvas](https://docs.falkordb.com/browser/ui/graph-canvas.html)
      * [Graph Info Panel](https://docs.falkordb.com/browser/ui/graph-info-panel.html)
      * [Style Panel](https://docs.falkordb.com/browser/ui/style-panel.html)
      * [Data / Property Panel](https://docs.falkordb.com/browser/ui/data-panel.html)
      * [Query Editor](https://docs.falkordb.com/browser/ui/query-editor.html)
      * [Query History](https://docs.falkordb.com/browser/ui/query-history.html)
      * [Table View](https://docs.falkordb.com/browser/ui/table-view.html)
      * [Metadata View](https://docs.falkordb.com/browser/ui/metadata-view.html)
      * [Graph Toolbar & Element Actions](https://docs.falkordb.com/browser/ui/toolbar-actions.html)
      * [Chat Panel](https://docs.falkordb.com/browser/ui/chat-panel.html)
  * [Cloud DBaaS](https://docs.falkordb.com/cloud/)
    * [Free Tier](https://docs.falkordb.com/cloud/free-tier.html)
    * [Startup Tier](https://docs.falkordb.com/cloud/startup-tier.html)
    * [Pro Tier](https://docs.falkordb.com/cloud/pro-tier.html)
    * [Enterprise Tier](https://docs.falkordb.com/cloud/enterprise-tier.html)
    * [Features](https://docs.falkordb.com/cloud/features.html)
  * [Operations](https://docs.falkordb.com/operations/)
    * [Migration](https://docs.falkordb.com/operations/migration/)
      * [RedisGraph to FalkorDB](https://docs.falkordb.com/operations/migration/redisgraph-to-falkordb.html)
      * [Neo4j to FalkorDB](https://docs.falkordb.com/operations/migration/neo4j-to-falkordb.html)
      * [Kuzu to FalkorDB](https://docs.falkordb.com/operations/migration/kuzu-to-falkordb.html)
      * [RDF to FalkorDB](https://docs.falkordb.com/operations/migration/rdf-to-falkordb.html)
      * [SQL Sources to FalkorDB (Online Migration)](https://docs.falkordb.com/operations/migration/sql-to-falkordb.html)
    * [Durability](https://docs.falkordb.com/operations/durability.html)
      * [Persistence on Docker](https://docs.falkordb.com/operations/persistence.html)
    * [Replication](https://docs.falkordb.com/operations/replication.html)
    * [Cluster](https://docs.falkordb.com/operations/cluster.html)
    * [Kubernetes support](https://docs.falkordb.com/operations/k8s-support.html)
    * [OpenTelemetry Integration](https://docs.falkordb.com/operations/opentelemetry.html)
    * [Railway](https://docs.falkordb.com/operations/railway.html)
    * [FalkorDBLite](https://docs.falkordb.com/operations/falkordblite/)
      * [FalkorDBLite (Python)](https://docs.falkordb.com/operations/falkordblite/falkordblite-py.html)
      * [FalkorDBLite (TypeScript)](https://docs.falkordb.com/operations/falkordblite/falkordblite-ts.html)
    * [Lightning.AI](https://docs.falkordb.com/operations/lightning-ai.html)
    * [Building Docker](https://docs.falkordb.com/operations/building-docker.html)
    * [KubeBlocks](https://docs.falkordb.com/operations/kubeblocks.html)
    * [Docker and Docker Compose](https://docs.falkordb.com/operations/docker.html)
  * [Agentic Memory](https://docs.falkordb.com/agentic-memory/)
    * [Graphiti](https://docs.falkordb.com/agentic-memory/graphiti.html)
    * [Cognee](https://docs.falkordb.com/agentic-memory/cognee.html)
    * [Graphiti MCP Server](https://docs.falkordb.com/agentic-memory/graphiti-mcp-server.html)
    * [Mem0](https://docs.falkordb.com/agentic-memory/mem0.html)
  * [The FalkorDB Design](https://docs.falkordb.com/design/)
    * [Client Specification](https://docs.falkordb.com/design/client-spec.html)
    * [Result Set Structure](https://docs.falkordb.com/design/result-structure.html)
    * [GRAPH.BULK endpoint specification](https://docs.falkordb.com/design/bulk-spec.html)
    * [Third Party](https://docs.falkordb.com/design/third-party.html)
  * [References](https://docs.falkordb.com/References/)
    * [FalkorDB License](https://docs.falkordb.com/References/license.html)

This site uses
Search FalkorDB Docs
#  [](https://docs.falkordb.com/udfs/#udfs) UDFs
Every database comes with a set of built-in functions. For example, FalkorDB functions include:
  * `abs` - computes the absolute value of a number
  * `pow` - computes v^x
  * `trim` - removes leading and trailing spaces.


These functions are built into the database and are part of its source code. Introducing a new function (for example, `UpperCaseOdd`) is not always trivial. The function needs to be usable to a wide audience for it to be considered. In the past, FalkorDB has rejected requests for adding new functions when these were too specific and did not add significant value for most users.
However, with the support of UDFs, everyone can extend FalkorDB’s functionality with their own set of functions. The following sections introduce UDFs and explain how to manage and use them within FalkorDB.
##  [](https://docs.falkordb.com/udfs/#practical-example) Practical Example
To introduce UDFs, review the following complete example, which loads a new UDF library called “StringUtils” that includes a single function called “UpperCaseOdd”. Once loaded, the script puts the function to use.
```
from falkordb import FalkorDB

# Connect to FalkorDB
db = FalkorDB(host='localhost', port=6379)

# Define UDF library name & script
lib = "StringUtils"

# UpperCaseOdd implementation in JavaScript
script = """
function UpperCaseOdd(s) {
    return s.split('')
        .map((char, i) => {
            if (i % 2 !== 0) {
                return char.toUpperCase();
            }
            return char;
        })
    .join('');
};

// expose UDF to FalkorDB
falkor.register('UpperCaseOdd', UpperCaseOdd);
"""

# Load UDF into the database
db.udf_load(lib, script)

# Call UDF
graph = db.select_graph("G")
s = graph.query("RETURN StringUtils.UpperCaseOdd('abcdef')").result_set[0][0]
print(f"s: {s}") # prints 'aBcDeF'

```

##  [](https://docs.falkordb.com/udfs/#commands-specification) Commands Specification
The FalkorDB-PY Python client provides convenient access to UDF functionality, but FalkorDB also exposes this functionality via a set of GRAPH.UDF  commands.
###  [](https://docs.falkordb.com/udfs/#graphudf-load-replace--) GRAPH.UDF LOAD [REPLACE]
To add a UDF, call `GRAPH.UDF LOAD` followed by an optional `REPLACE` keyword. When specified, the REPLACE keyword replaces an already registered UDF library. The command then takes two arguments: the library name and the library script (written in JavaScript).
A UDF library can expose multiple UDFs. The following example shows a script that includes both non-exposed utility functions and a number of callable functions:
```
function ShapeType(shape) {
	return shape.type;
}

function Triangle() {
	return {type: 'triangle', a:2, b:3, c:5};
}

function RandomShape() {
	return Triangle();
}

function Area(shape) {
    if (ShapeType(shape) == 'triangle') {
		return (shape.a * shape.b) / 2;
    } else {
        throw new Error("Unsupported shape");
    }
}

function Perimeter(shape) {
   if (ShapeType(shape) == 'triangle') {
		return shape.a + shape.b + shape.c;
    } else {
        throw new Error("Unsupported shape");
    }
}

// Expose functions
falkor.register('Area', Area);
falkor.register('Perimeter', Perimeter);
falkor.register('RandomShape', RandomShape);

```

For each UDF script, FalkorDB exposes the falkor object, through which you register UDFs. To register a function, call `falkor.register` and provide the name you wish to expose your function under, followed by either an anonymous function or the actual function.
For example:
```
falkor.register('Area', Area);
falkor.register('Perimeter', function(s) {return s.a + s.b + s.c});

```

Once loaded your functions are available as if they were built-in functions and can be invoked in the same way.
For example:
```
WITH Shapes.RandomShape() AS s
WHERE s.a > 1
CREATE (p:Position {area: Shapes.Area(s), perimeter: Shapes.Perimeter(s)})
SET p += s
RETURN s

```

###  [](https://docs.falkordb.com/udfs/#graphudf-list-lib-withcode) GRAPH.UDF LIST [Lib] [WITHCODE]
To list loaded UDF libraries you can either use the FalkorDB-PY `udf_list` function or invoke the `GRAPH.UDF LIST` command via a direct connection to the DB.
The command takes two optional arguments:
  * Lib: list only a specific library.
  * WITHCODE: to include the library source code as part of the output.


For example: Calling the command: `GRAPH.UDF LIST WITHCODE` will generate the following output:
```
1) 1) library_name
   2) Shapes
   3) functions
   4) 1) Area
      2) Perimeter
      3) RandomShape
   5) library_code
   6) "function ShapeType(shape) {return shape.type;} function Triangle() {return {type: 'triangle', a:2, b:3, c:5};}...

```

###  [](https://docs.falkordb.com/udfs/#graphudf-delete-) GRAPH.UDF DELETE
To remove a UDF library use either the `udf_delete` FalkorDB-PY function, or send a `GRAPH.UDF DELETE <library>` command via a direct connection to the database.
For example:
```
from falkordb import FalkorDB

# Connect to FalkorDB
db = FalkorDB(host='localhost', port=6379)

# Remove the Shapes UDF library
db.udf_delete("Shapes")

```

###  [](https://docs.falkordb.com/udfs/#graphudf-flush) GRAPH.UDF FLUSH
Similar to delete `GRAPH.UDF FLUSH` removes **all** UDF libraries from the database.
```
from falkordb import FalkorDB

# Connect to FalkorDB
db = FalkorDB(host='localhost', port=6379)

# Remove all UDF libraries
db.udf_flush()

```

##  [](https://docs.falkordb.com/udfs/#datatypes) Datatypes
Any datatype available in FalkorDB is accessible within UDFs, these include: Scalar, Node, Edge & Path objects.
###  [](https://docs.falkordb.com/udfs/#node) Node
In a UDF, a node object exposes its `ID`, `labels` and `attributes` via the corresponding properties:
  * `id` - node internal ID
  * `labels` - node’s labels
  * `attributes` - node’s attributes


For example:
```
function stringify_node(n) {
    return "id: " + n.id + " labels: " + JSON.stringify(n.labels) + " attributes: " + JSON.stringify(n.attributes);
}

```

You can also collect a node’s neighbors by calling the node’s `getNeighbors` function. The getNeighbors function accepts an optional config map:
config name | type | description | example
---|---|---|---
direction | string | direction of edges to traverse | ‘incoming’ / ‘outgoing’ / ‘both’
types | string array | edge relationship types to consider | [‘KNOWS’, ‘WORKS_AT’]
labels | string array | node types to consider | [‘Person’, ‘City’]
returnType | string | return type, array of nodes or edges | ‘nodes’ / ‘edges’
###  [](https://docs.falkordb.com/udfs/#edge) Edge
In a UDF, an edge object exposes its `ID`, `type`, `source`, `target` and `attributes` via the corresponding properties:
  * `id` - edge internal ID
  * `type` - edge’s relationship type
  * `source` - edge’s start node
  * `target` - edge’s end node
  * `attributes` - edge’s attributes


For example:
```
function stringify_edge(e) {
    return "id: " + e.id +
			" type: " + e.type +
			" sourceNode: " + e.source.id +
			" targetNode: " + e.target.id +
			" attributes: " + JSON.stringify(e.attributes);
}

```

###  [](https://docs.falkordb.com/udfs/#path) Path
In a UDF, a path object exposes its `nodes`, `length` and `relationships` via the corresponding properties:
  * `nodes` - path’s nodes
  * `length` - path’s length
  * `relationships` - path’s edges


For example:
```
function stringify_path(p) {
    return "nodes: " + p.nodes +
			"length: " + p.length +
			"relationships: " + p.relationships;
}

```

##  [](https://docs.falkordb.com/udfs/#global-objects) Global objects
###  [](https://docs.falkordb.com/udfs/#graph) Graph
UDFs have access to a global `graph` object which represents the current graph executing the UDF. The object exposes a single function `traverse` which is similar to the node’s `getNeighbors` function (see docs above) but can perform multi-source traversal, which can be faster than performing multiple individual calls to getNeighbors.
```
function multi_source_bfs(sources, config) {
    const targets = graph.traverse(sources, config) ;
    // source i neighbors are in targets[i], which is an array of node or edge objects
    // depending on the optional config map passed to graph.traverse
    const s0_neighbors = targets[0];
    ...
}

```

###  [](https://docs.falkordb.com/udfs/#falkor) Falkor
The `falkor` global object represents the FalkorDB database and is used mostly to register UDFs. The object exposes two functions:
  * `log` - logs a message to the database stdout.
  * `register` - exposes a function to the database.


####  [](https://docs.falkordb.com/udfs/#falkorlog) falkor.log
#####  [](https://docs.falkordb.com/udfs/#description) Description
Logs a message to the database stdout
#####  [](https://docs.falkordb.com/udfs/#syntax) Syntax
```
falkor.log(msg)

```

#####  [](https://docs.falkordb.com/udfs/#parameters) Parameters
Parameter | Type | Required | Description
---|---|---|---
`message` | string | Yes | message to log
####  [](https://docs.falkordb.com/udfs/#falkorregister) falkor.register
#####  [](https://docs.falkordb.com/udfs/#description-1) Description
Register a function to the database
#####  [](https://docs.falkordb.com/udfs/#syntax-1) Syntax
```
falkor.register(name, function)

```

#####  [](https://docs.falkordb.com/udfs/#parameters-1) Parameters
Parameter | Type | Required | Description
---|---|---|---
`name` | string | Yes | expose function under this name
`function` | function pointer | Yes | function to expose
#####  [](https://docs.falkordb.com/udfs/#example) Example
```
function add(a,b) {
    return a + b;
}

falkor.register('addition', add);

```

##  [](https://docs.falkordb.com/udfs/#advanced-examples) Advanced examples
In this example, we’ll implement Jaccard similarity for nodes. Jaccard’s formula is: J(A,B) = |A ∩ B| / |A ∪ B| = |A ∩ B| / (|A| + |B| - |A ∩ B|)
In simple terms, to compute Jaccard similarity for two nodes A and B, compute the number of shared neighbors between them and divide it by the total number of neighbors. If A and B have the same neighbors, their similarity value is 1. If they have no shared neighbors, their similarity value is 0.
To start, define two UDFs (union and intersection) in a collection.js file:
```
function union (a, b) {
  return [...new Set([...a, ...b])];
}

function intersection (a, b) {
  const setB = new Set(b);
  return a.filter(x => setB.has(x));
}

falkor.register('union', union);
falkor.register('intersection', intersection);

```

With these functions defined, proceed to implement Jaccard similarity. Create `similarity.js` as follows:
```
function jaccard(a, b) {
    const aIds = a.getNeighbors().map(x => x.id);
    const bIds = b.getNeighbors().map(x => x.id);

    const unionSize = union(aIds, bIds).length;
    const intersectionSize = intersection(aIds, bIds).length;

    return unionSize === 0 ? 0 : intersectionSize / unionSize;
}

falkor.register('jaccard', jaccard);

```

Notice that jaccard uses both `union` and `intersection` from `collection.js`, and also collects A’s and B’s neighbors via a call to `getNeighbors`.
The remaining step is to load these UDF libraries into FalkorDB and use them:
```
from falkordb import FalkorDB

db = FalkorDB()
g = db.select_graph("G")
g.delete()

def load_script(name, script_path):
    with open(script_path, "r") as f:
        content = f.read()
        db.udf_load(name, content, True)

def load_graph(g):
    q = """CREATE
        (eve:Person   {name: 'Eve'}),
        (bob:Person   {name: 'Bob'}),
        (dave:Person  {name: 'Dave'}),
        (carol:Person {name: 'Carol'}),
        (alice:Person {name: 'Alice'}),
        (eve)-[:FRIEND]->(bob),
        (bob)-[:FRIEND]->(alice),
        (bob)-[:FRIEND]->(carol),
        (bob)-[:FRIEND]->(eve),
        (dave)-[:FRIEND]->(alice),
        (carol)-[:FRIEND]->(alice),
        (carol)-[:FRIEND]->(bob),
        (alice)-[:FRIEND]->(bob),
        (alice)-[:FRIEND]->(carol),
        (alice)-[:FRIEND]->(dave)"""

    g.query(q)

def compute_jaccard_sim(g):
    q = """MATCH (alice:Person {name: 'Alice'}), (n)
           RETURN alice.name, n.name, similarity.jaccard(alice, n) AS sim"""
    results = g.query(q).result_set

    for row in results:
        alice = row[0]
        node  = row[1]
        sim   = row[2]
        print(f"Jaccard similarity between {alice} and {node} is: {sim}")

# load UDFs
load_script("collection", "./collection.js")
load_script("similarity", "./similarity.js")

load_graph(g)
compute_jaccard_sim(g)

```

The scripts load our two UDF libraries `collection` and `similarity`, construct a graph, and compute Jaccard similarity between `Alice` and every other node in the graph via the query:
```
MATCH (alice:Person {name: 'Alice'}), (n)
RETURN alice.name, n.name, similarity.jaccard(alice, n) AS sim

```

Output:
```
Jaccard similarity between Alice and Eve is: 0.333
Jaccard similarity between Alice and Bob is: 0.2
Jaccard similarity between Alice and Dave is: 0
Jaccard similarity between Alice and Carol is: 0.25
Jaccard similarity between Alice and Alice is: 1

```

###  [](https://docs.falkordb.com/udfs/#custom-traversals) Custom Traversals
In some situations where you want fine control over the way graph traversals are made, Cypher might not be flexible enough. Consider the following requirement: collect all reachable nodes from a given start node, where a neighbor node is added to the expanded path if its amount value is greater than the accumulated sum of amounts on the current path.
The following UDF accomplishes this traversal. It performs a DFS and only expands to neighbors whose `amount` value is greater than the accumulated sum of amounts along the current path:
```
function DFS_IncreasingAmounts(n, visited, total, reachables) {
    // Add current node to visited to prevent infinite loops in cycles
    visited.push(n.id);

    for (const neighbor of n.getNeighbors()) {
        // 1. Check if already visited
        // 2. Logic: neighbor.amount must be GREATER than accumulated amount
        if (visited.includes(neighbor.id) || neighbor.amount <= total) {
            continue;
        }

        // Add to the list of discovered reachable nodes
        reachables.push(neighbor);

        // Recurse: add the neighbor's amount to the accumulated sum
        DFS_IncreasingAmounts(
            neighbor,
            visited,
            total + neighbor.amount,
            reachables
        );
    }
}

function CollectIncreasingAmounts(n) {
    const visited = [];
    const reachables = [];

	DFS_IncreasingAmounts(n, visited, n.amount, reachables);

    return reachables;
}

// Register function to be later used in a query
falkor.register('CollectIncreasingAmounts', CollectIncreasingAmounts);

```

The remaining step is to load this UDF:
```
from falkordb import FalkorDB

db = FalkorDB()
g = db.select_graph("G")

# Load UDF
with open("./traversals.js", "r") as f:
	content = f.read()
	db.udf_load("Traversals", content, True)

# Use our custom traversal to find relevant reachable nodes
q = """MATCH (n:Transaction)
	   WHERE n.id = 12
       RETURN Traversals.CollectIncreasingAmounts(n)"""

reachables = g.query(q).result_set[0][0]
for node in reachables:
    print(f"Node ID: {node.id}, Amount: {node.properties.get('amount')}")

```

##  [](https://docs.falkordb.com/udfs/#flex) FLEX
FLEX (FalkorDB Library of Extensions) is FalkorDB’s open source community UDF package, available at
It contains a variety of useful functionality, including:
  * String and set similarity metrics for fuzzy matching and comparison
  * Date and time manipulation, formatting, and parsing
  * Low-level bitwise operations on integers


Contributions to extend this library with additional functionality are welcome.
##  [](https://docs.falkordb.com/udfs/#limitations) Limitations
> Currently, UDFs are not allowed to modify the graph in any way. You cannot update graph entities within a UDF, nor can you add or delete entities.
* * *
## Table of contents
  * [FLEX Function Reference](https://docs.falkordb.com/udfs/flex/)


* * *
This site uses
